Задача «Максимум»
Условие
Найдите индексы первого вхождения максимального элемента. Выведите два числа: номер строки и номер столбца, в которых стоит наибольший элемент в двумерном массиве. Если таких элементов несколько, то выводится тот, у которого меньше номер строки, а если номера строк равны то тот, у которого меньше номер столбца.
Программа получает на вход размеры массива n и m, затем n строк по m чисел в каждой.
Решение:
n, m = [int(i) for i in input().split()]
a = [[int(j) for j in input().split()] for i in range(n)]
i_max, j_max = 0, 0
maximum = a[0][0]
for i in range(n):
    for j in range(m):
        if a[i][j] > maximum:
            maximum = a[i][j]
            i_max, j_max = i, j
print(i_max, j_max)